In [122]:
# Import Libraries and Dependencies
import pandas as pd
from pathlib import Path

### 1. Combine and Clean the Data
#### Import CSVs

In [123]:
# Read the CSV files into DataFrames.
athletic_sales_2020_csv = Path("/Users/jedmurph/Documents/CODE/athletic_sales_analysis/M5_Starter_Code/Resources/athletic_sales_2020.csv")
athletic_sales_2021_csv = Path("/Users/jedmurph/Documents/CODE/athletic_sales_analysis/M5_Starter_Code/Resources/athletic_sales_2021.csv")

athletic_sales_2020_df = pd.read_csv(athletic_sales_2020_csv)
athletic_sales_2021_df = pd.read_csv(athletic_sales_2021_csv)

In [124]:
# Display the 2020 sales DataFrame
athletic_sales_2020_df.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,50,1200,600000,300000.00,In-store
1,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,68,83,5644,2426.92,Online
2,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,75,275,206250,61875.00,Outlet
3,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,34,384,13056,6789.12,Outlet
4,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,53,83,4399,1407.68,Outlet

In [125]:
# Display the 2021 sales DataFrame
athletic_sales_2021_df.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,65,750,487500,121875.00,Outlet
1,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,51,233,11883,3208.41,Outlet
2,Kohl's,1189833,1/1/21,Midwest,Montana,Billings,Men's Apparel,50,275,137500,82500.00,Outlet
3,Kohl's,1189833,1/1/21,Midwest,Montana,Billings,Men's Apparel,47,77,3619,2714.25,Online
4,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,64,225,14400,5184.00,Online

#### Check the data types of each DataFrame

In [126]:
# Check the 2020 sales data types.
print(athletic_sales_2020_df.dtypes)

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

In [127]:
# Check the 2021 sales data types.
print(athletic_sales_2021_df.dtypes)

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

#### Combine the sales data by rows.

In [128]:
# Combine the 2020 and 2021 sales DataFrames on the rows and reset the index.
combined_2020_2021_df = pd.concat([athletic_sales_2020_df, athletic_sales_2021_df]).reset_index(drop=True)

print(combined_2020_2021_df)

         retailer  retailer_id invoice_date     region         state  \
0     Foot Locker      1185732       1/1/20  Northeast      New York
1     Foot Locker      1185732       1/1/20  Northeast  Pennsylvania
2     Foot Locker      1185732       1/1/20  Northeast  Pennsylvania
3     Foot Locker      1185732       1/1/20  Northeast      New York
4     Foot Locker      1185732       1/1/20  Northeast  Pennsylvania
...           ...          ...          ...        ...           ...
9638  Foot Locker      1185732     12/31/21  Northeast  Pennsylvania
9639  Foot Locker      1185732     12/31/21  Northeast  Pennsylvania
9640       Amazon      1185732     12/31/21  Northeast         Maine
9641       Amazon      1185732     12/31/21  Northeast         Maine
9642  Foot Locker      1185732     12/31/21  Northeast  Pennsylvania

              city                product  price_per_unit  units_sold  \
0         New York  Men's Street Footwear              50        1200
1     Philadelphia        Women's Apparel              68          83
2     Philadelphia        Women's Apparel              75         275
3         New York  Men's Street Footwear              34         384
4     Philadelphia        Women's Apparel              53          83
...            ...                    ...             ...         ...
9638  Philadelphia          Men's Apparel              63          47
9639  Philadelphia          Men's Apparel              46          56
9640      Portland          Men's Apparel              52          36
9641      Portland          Men's Apparel              55         125
9642  Philadelphia          Men's Apparel              70         175

      total_sales  operating_profit sales_method
0          600000         300000.00     In-store
1            5644           2426.92       Online
2          206250          61875.00       Outlet
3           13056           6789.12       Outlet
4            4399           1407.68       Outlet
...           ...               ...          ...
9638         2961           1362.06       Online
9639         2576           1004.64       Outlet
9640         1872            692.64       Online
9641        68750          17187.50       Outlet
9642       122500          42875.00       Outlet

[9643 rows x 12 columns]

In [129]:
# Check if any values are null.
athletic_sales_null_values = combined_2020_2021_df.isnull().sum()

print(athletic_sales_null_values)

retailer            0
retailer_id         0
invoice_date        0
region              0
state               0
city                0
product             0
price_per_unit      0
units_sold          0
total_sales         0
operating_profit    0
sales_method        0
dtype: int64

In [130]:
# Check the data type of each column
column_data_types = combined_2020_2021_df.dtypes

print(column_data_types)

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

In [131]:
# Convert the "invoice_date" to a datetime datatype
combined_2020_2021_df["invoice_date"] = pd.to_datetime(combined_2020_2021_df["invoice_date"])

/var/folders/3c/1tlsztzj1zv8dh6mlt_6d48c0000gn/T/ipykernel_53185/4237754865.py:2: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  combined_2020_2021_df["invoice_date"] = pd.to_datetime(combined_2020_2021_df["invoice_date"])

In [132]:
# Confirm that the "invoice_date" data type has been changed.
print(combined_2020_2021_df.dtypes)

retailer                    object
retailer_id                  int64
invoice_date        datetime64[ns]
region                      object
state                       object
city                        object
product                     object
price_per_unit               int64
units_sold                   int64
total_sales                  int64
operating_profit           float64
sales_method                object
dtype: object

### 2. Determine which Region Sold the Most Products

#### Using `groupby`

In [133]:
# Show the number products sold for region, state, and city.
# Rename the sum to "Total_Products_Sold".

region_state_city_sales = combined_2020_2021_df.groupby(["region", "state", "city"]).agg(Total_Products_Sold=("units_sold", "sum"))



# Show the top 5 results.
region_state_city_sales.head()

                               Total_Products_Sold
region  state    city
Midwest Illinois Chicago                     25407
        Indiana  Indianapolis                26332
        Iowa     Des Moines                  23446
        Kansas   Wichita                     29463
        Michigan Detroit                     50095

#### Using `pivot_table`

In [134]:
# Show the number products sold for region, state, and city.
region_state_city_total_sold = pd.pivot_table(combined_2020_2021_df, 
                                       index=["region", "state", "city"], 
                                       values="units_sold",
                                       aggfunc="sum")

# Rename the "units_sold" column to "Total_Products_Sold"
combined_2020_2021_df = combined_2020_2021_df.rename(columns={"units_sold": "Total_Products_Sold"})

# Show the top 5 results.
region_state_city_total_sold.head(10)

                                   units_sold
region  state        city
Midwest Illinois     Chicago            25407
        Indiana      Indianapolis       26332
        Iowa         Des Moines         23446
        Kansas       Wichita            29463
        Michigan     Detroit            50095
        Minnesota    Minneapolis        20415
        Missouri     St. Louis          36404
        Montana      Billings           42713
        Nebraska     Omaha              19154
        North Dakota Fargo              22781

### 3. Determine which Region had the Most Sales

#### Using `groupby`

In [135]:
# Show the total sales for the products sold for each region, state, and city.
# Rename the "total_sales" column to "Total Sales"
region_state_city_total_sales = combined_2020_2021_df.groupby(["region", "state", "city"])["total_sales"].sum().reset_index()
region_state_city_total_sales = region_state_city_total_sales.rename(columns={"total_sales": "Total Sales"})

# Show the top 5 results.
region_state_city_total_sales.head()

    region     state          city  Total Sales
0  Midwest  Illinois       Chicago      9797488
1  Midwest   Indiana  Indianapolis      8836198
2  Midwest      Iowa    Des Moines      7424011
3  Midwest    Kansas       Wichita      9972864
4  Midwest  Michigan       Detroit     18625433

#### Using `pivot_table`

In [136]:
# Show the total sales for the products sold for each region, state, and city.
region_state_city_total_sales_pivot = pd.pivot_table(combined_2020_2021_df,
                                               index=["region", "state", "city"],
                                               values="total_sales",
                                               aggfunc="sum")


# Optional: Rename the "total_sales" column to "Total Sales"
region_state_city_total_sales_pivot = region_state_city_total_sales_pivot.rename(columns={"total_sales": "Total Sales"})

# Show the top 5 results.
region_state_city_total_sales_pivot.head()

                               Total Sales
region  state    city
Midwest Illinois Chicago           9797488
        Indiana  Indianapolis      8836198
        Iowa     Des Moines        7424011
        Kansas   Wichita           9972864
        Michigan Detroit          18625433

### 4. Determine which Retailer had the Most Sales

#### Using `groupby`

In [138]:
# Show the total sales for the products sold for each retailer, region, state, and city.
# Rename the "total_sales" column to "Total Sales"
retailer_region_state_city_totsales = combined_2020_2021_df.groupby(["retailer", "region", "state", "city"])["total_sales"].sum().reset_index()
retailer_region_state_city_totsales = retailer_region_state_city_totsales.rename(columns={"total_sales": "Total Sales"})

# Show the top 5 results.
retailer_region_state_city_totsales.head()

  retailer     region          state        city  Total Sales
0   Amazon    Midwest           Ohio    Columbus     16835873
1   Amazon  Northeast          Maine    Portland      8611395
2   Amazon  Northeast  Massachusetts      Boston      4193590
3   Amazon  Northeast  New Hampshire  Manchester     10077142
4   Amazon  Northeast        Vermont  Burlington     13380463

#### Using `pivot_table`

In [ ]:
# Show the total sales for the products sold for each retailer, region, state, and city.


# Optional: Rename the "total_sales" column to "Total Sales"


# Show the top 5 results.

### 5. Determine which Retailer Sold the Most Women's Athletic Footwear

In [ ]:
# Filter the sales data to get the women's athletic footwear sales data.

#### Using `groupby`

In [ ]:
# Show the total number of women's athletic footwear sold for each retailer, region, state, and city.
# Rename the "units_sold" column to "Womens_Footwear_Units_Sold"

# Show the top 5 results.

#### Using `pivot_table`

In [ ]:
# Show the total number of women's athletic footwear sold for each retailer, region, state, and city.


# Rename the "units_sold" column to "Womens_Footwear_Units_Sold"

# Show the top 5 results.

### 5. Determine the Day with the Most Women's Athletic Footwear Sales

In [ ]:
# Create a pivot table with the 'invoice_date' column is the index, and the "total_sales" as the values.


# Optional: Rename the "total_sales" column to "Total Sales"


# Show the table.

In [ ]:
# Resample the pivot table into daily bins, and get the total sales for each day.


# Sort the resampled pivot table in ascending order on "Total Sales".

### 6.  Determine the Week with the Most Women's Athletic Footwear Sales

In [ ]:
# Resample the pivot table into weekly bins, and get the total sales for each week.


# Sort the resampled pivot table in ascending order on "Total Sales".